#+TITLE: Data Analysis
***** 数组的生成
1. .arange(start, end, step)
2. .linspace(start, end, split)
3. .logspace(start, end, split) 对数，以10为底
4. .zeros ones(dimx, dimy)
5. .empty()
#+begin_src python
a = np.empty(6)
a.shape
#+end_src
#+RESULTS:
 : (6,)
6. .fill(number) 填充数字
7. * .zeros_like(ndarray)* 
创建一个维度一样的空数组
#+begin_src python
tang_array = np.array([1,2,3,4])
np.zeros_like(tang_array)
#+end_src
#+result
: array([0,0,0,0])
8. .ones_like(tang_array)
#+begin_src  python 
tang_array = np.array([1,2,3,4])
np.ones_like(tang_array)
#+end_src
9. .identity(5) 
构建对角阵
